<?xml version='1.0' encoding='utf-8'?>
<chapter>
	<title>Instalaci&oacute;n de LAMP</title>
	<section>
		<title>Instalaci&oacute;n de una LAMP en Ubuntu 10.04</title>
		<para>A continuación se detallarán los pasos necesarios para la instalación de un entorno LAMP en Ubuntu 10.04</para>
		<para>La instalaci&oacute;n del entorno LAMP en Ubuntu se realiza a trav&eacute;s de cualquiera de los gestores de paquetes que dispone la distribuci&oacute;n: apt-get, aptitude y synaptic. Todos estos gestores de paquetes necesitan permisos de administraci&oacute;n para ser ejecutados. Por lo que ser&aacute; necesario ejecutarlos precedido de uno de los comandos "sudo" o "gksu".</para>
		<para>Para ejecutar synaptic, tan s&oacute;lo debemos abrir el men&uacute; Sistema/Administraci&oacute;n/Gestor de paquetes Synaptic.Nos saldr&aacute; una pantalla similar a la siguiente:</para>
		<figure>
			<title>Ventana principal de Synaptic.</title>
              <graphic fileref="img/captura-ubuntu-001-synaptic.png" format="PNG" scale="100" />
		</figure>
		<para>En el cuadro de b&uacute;squeda nos permite introducir el nombre de un paquete y se actualizar&aacute; el listado de paquetes para ajustarse a la b&uacute;squeda realizada.</para>
		<para>Una vez hayamos conseguido buscar el paquete, mediante un doble click le indicaremos que deseamos instalarlo, es posible que nos indique que dicho paquete tiene dependencias y que debemos instalarlas. Si esta pantalla apareciera, deberíamos marcar dichos paquetes para instalarlos.</para>
		<figure>
			<title>Ventana de confirmaci&oacute; de dependencias.</title>
              <graphic fileref="img/captura-ubuntu-002-dependencias.png" format="PNG" scale="100" />
		</figure>
		<para>Cuando hayamos terminado de seleccionar aquellos paquetes que queremos instalar, pulsaremos sobre el bot&oacute;n "Aplicar". Saldr&aacute; una pantalla de confirmación similar a la siguiente:</para>
		<figure>
			<title>Cuadro de resumen de aplicar cambios.</title>
              <graphic fileref="img/captura-ubuntu-003-aplicar-cambios.png" format="PNG" scale="100" />
		</figure>
		<para>Como podemos observar en la figura nos indica el n&uacute;mero de paquetes a instalar, su tama&ntilde;o de desarga y una vez instalado, etc... A continuaci&oacute;n pulsaremos sobre el bot&oacute;n "Aplicar".</para>
		<para>Luego aparecer&aacute; una pantalla en la que se ir&aacute;n descargando los paquetes.</para>
		<figure>
			<title>Cuadro de progreso de descarga de paquetes.</title>
              <graphic fileref="img/captura-ubuntu-004-descarga.png" format="PNG" scale="100" />
		</figure>
		<para>Una vez haya terminado de descargar correctamente los paquetes, se realiza su instalaci&oacute;n, aparecer&aacute; una pantalla similar a la siguiente.</para>
		<figure>
			<title>Cuadro de progreso de instalaci&oacute;n de paquetes.</title>
              <graphic fileref="img/captura-ubuntu-005-instalando-paquetes.png" format="PNG" scale="100" />
		</figure>		
		<para>Es posible que durante la instalaci&oacute;n de los paquetes tengamos que realizar configuraciones espec&iacute;ficas de los mismos.</para>
		<para>Para instalar instalar un entorno completo de ejecuci&oacute;n de aplicaciones LAMP es necesario instalar los siguientes paquetes: apache2, libapache2-mod-php5, php5-mysql y mysql-server. Para ello utilizaremos Synaptic tal como se ha explciado anteriormente. Aparecer&aacute; uns pantallade configuraci&oacute;n similar a la siguiente.</para>
		<figure>
			<title>Cuadro de configuraci&oacute;n del servidor de Mysql.</title>
              <graphic fileref="img/captura-ubuntu-006-config-mysql-server.png" format="PNG" scale="100" />
		</figure>
		<para>Aqu&iacute; podremos configurar la contrase&ntilde;a del usuario administrador del servidor Mysql "root".</para>
		<para>Cuando se hayan terminado de instalar y configurar todos los paquetes ya podremos empezar a probar la instalaci&oacute;n realizada.</para>
		<para>El directorio principal de Apache en Ubuntu es /var/www por lo que todas las carpetas y ficheros que se encuentren en dicha carpeta ser&aacute;n accesibles a trav&eacute;s del navegador mediante la direcci&oacute;n http://localhost/ .</para>
		<para>Para ello </para>
	</section>
<section>
<title>Instalaci&oacute;n de una LAMP en OpenSuse 10.2</title>
<para>
En OpenSuse 10.2 esta tarea es muy sencilla, describimos ahora todos los pasos:
</para>
<itemizedlist>
<listitem>
<para>
Entre en el Men&uacute; de Acciones (KickOff) en el apartado de PC y pulse en el Configurador de administraci&oacute;n YAST.
</para>
<figure>
	<title>Entrada a YAST desde KickOff</title>
              <graphic fileref="img/Captura002-yast-acceso.png" format="PNG" scale="60" />
</figure>
</listitem>
<listitem>
<para>
Val&iacute;dese como Superusuario. En cuanto intente entrar en YAST deber&aacute; introducir la contrase&ntilde;a del SuperAdministrador 
(root) y pulsar en el bot&oacute;n Acaptar.
</para>
<figure>
	<title>Cuadro de di&aacute;logo para introducir la contrase&ntilde;a de administrador.</title>
              <graphic fileref="img/Captura003-yast-validacion.png" format="PNG" scale="100" />
</figure>
</listitem>
<listitem>
<para>
En la pesta&ntilde;a de Software pulse en el icono de Instalar/desinstalar Software.
</para>
<figure>
	<title>Acceso a herramienta de instalaci&oacute;n y desinstalaci&oacute;n de Software</title>
              <graphic fileref="img/Captura004-yast-instalar-desinstalar-software.png" format="PNG" scale="60" />
</figure>
</listitem>
<listitem>
<para>
En la pesta&ntilde;a de Software pulse en el icono de Instalar/desinstalar Software.
</para>
<figure>
	<title>Acceso a herramienta de instalaci&oacute;n y desinstalaci&oacute;n de Software</title>
              <graphic fileref="img/Captura004-yast-instalar-desinstalar-software.png" format="PNG" scale="60"/>
</figure>
</listitem>
<listitem>
<para>
Una vez haya entrado en la herramienta se actualizar&aacute;n los listado de Software disponibles para su manejo.
</para>
<figure>
	<title>Acceso a herramienta de instalaci&oacute;n y desinstalaci&oacute;n de Software</title>
              <graphic fileref="img/Captura005-yast-actualizando-listados.png" format="PNG" scale="100" />
</figure>
<para>
Cuando haya terminado de gestionar los listados, aparecer&aacute; una pantalla similar a la siguiente:
</para>
<figure>
	<title>Pantalla principal de instalaci&oacute;n y desintalaci&oacute;n de paquetes.</title>
              <graphic fileref="img/Captura006-yast-pantalla-principal.png" format="PNG" scale="40" />
</figure>
</listitem>
<listitem>
<para>
En la parte superior derecha de la pantalla aparece una etiqueta llamada filtro y una lista desplegable. pulse en ella 
y seleccione Patrones. Aparecer&aacute; un listado en la parte de la izquierda de la pantalla similar al siguiente:
</para>
<figure>
	<title>Acceso a herramienta de instalaci&oacute;n y desinstalaci&oacute;n de Software</title>
              <graphic fileref="img/Captura007-paquetes-patrones-seleccionados.png" format="PNG" scale="40" />
</figure>

<para>
En dicho listado aparecen grupos de paquetes con funcionalidades acompa&ntilde;ados de una caja de selecci&oacute;n al lado izquierdo 
de cada uno de ellos. Para seleccionar alguno de ellos pulse con el bot&oacute;n izquierdo en cualquiera de las cajas de selecci&oacute;n, 
esta caja aparecer&aacute; marcada con un s&iacute;mbolo de visto bueno, tambi&eacute;n ver&aacute; que en la parte de la derecha de la pantalla principal,
los paquetes individuales aparecer&aacute;n todos seleccionados. Para deseleccionar un patr&oacute;n repita la misma operaci&oacute;n, ver&aacute; que 
el s&iacute;mbolo de visto bueno desaparecer&aacute; de la caja de selecci&oacute;n.
</para>
</listitem>
<listitem>
<para>
Seleccione el patr&oacute;n denominado Servidor Web y LAMP. 
</para>
<figure>
	<title>Paquetes individuales seleccionados.</title>
              <graphic fileref="img/Captura008-paquetes-individuales-seleccionados.png" format="PNG" scale="40" />
</figure>
</listitem>
<listitem>
<para>
Pulse en el bot&oacute;n Aceptar. Aparecer&aacute; la pantalla de descarga de paquetes desde los medios:
</para>
<figure>
	<title>Paquetes individuales seleccionados.</title>
              <graphic fileref="img/Captura009-descarga-paquetes-medios.png" format="PNG" scale="40" />
</figure>
<para>
Introduzca el CD o DVD de instalaci&oacute;n de OpenSuse 10.2. y pulse en el bot&oacute;n Ok. Se iniciar&aacute; la descarga de paquetes individuales.
</para>
<figure>
	<title>Descarga de paquetes.</title>
              <graphic fileref="img/Captura010-descarga-paquetes-medios2.png" format="PNG" scale="40" />
</figure>

<para>
A continuaci&oacute;n se configur&aacute;n los paquetes y servicios con YAST.
</para>
<figure>
	<title>Configuraci&oacute;n de paquetes y Servicios.</title>
              <graphic fileref="img/Captura011-reconfigurando-paquetes.png" format="PNG" scale="40" />
</figure>
</listitem>
<listitem>
<para>
A continuaci&oacute;n pulse en el bot&oacute;n No en el cuadro de di&aacute;logo.
</para>
<figure>
	<title>pregunta de seguir instalando o no paquetes.</title>
              <graphic fileref="img/Captura012-seguir-instalando.png" format="PNG" scale="40" />
</figure>
<para>
Se cerrar&aacute; la venta de instalar y Desinstalar paquetes.
</para>
</listitem>
<listitem>
<para>
A continuaci&oacute;n pulse en el bot&oacute;n No en el cuadro de di&aacute;logo.
</para>
<figure>
	<title>Pregunta de seguir instalando o no paquetes.</title>
              <graphic fileref="img/Captura012-seguir-instalando.png" format="PNG" scale="40" />
</figure>
<para>
Se cerrar&aacute; la venta de instalar y Desinstalar paquetes.
</para>
</listitem>
<listitem>
<para>
A continuaci&oacute;n necesita activar el servidor Apache y el PHP. Para lo cual debe entrar en YAST en la pesta&ntilde;a Servicios de red en el 
icono Servidor HTTP.
</para>
<figure>
	<title>Acceso a la configuraci&oacute;n de Apache y PHP</title>
              <graphic fileref="img/Captura013-config-apache.png" format="PNG" scale="40" />
</figure>
</listitem>
<listitem>
<para>
Despu&eacute;s aparecer&aacute; la primera pantalla de configuraci&oacute;n de Apache. En ella deber&aacute;n aparecer: el puerto por el que escuchar&aacute; las 
peticiones web (por defecto 80) y las direcciones ip por las que se permite que escuche el servidor web(127.0.0.1 por defecto). 
Pulse en el bot&oacute;n Siguiente.
</para>
<figure>
	<title>Control de acceso por puerto e IP's.</title>
              <graphic fileref="img/Captura014-config-apache-paso1.png" format="PNG" scale="40" />
</figure>
</listitem>
<listitem>
<para>
A continuaci&oacute;n deber&aacute; marcar (si no lo est&aacute; hecho ya) el cuadro de selecci&oacute;n al lado de Habilitar lenguaje de guiones PHP5. Pulse en 
Siguiente.
</para>
<figure>
	<title>Control de lenguajes de scripting.</title>
              <graphic fileref="img/Captura015-config-apache-paso2.png" format="PNG" scale="40" />
</figure>
</listitem>
<listitem>
<para>
A continuaci&oacute;n puede ser los par&aacute;metros b&aacute;sicos del servidor, tales como directorio principal, direcci&oacute;n de correo del administrador, 
etc.  Pulse en Siguiente.
</para>
<figure>
	<title>Configuraci&oacute;n de par&aacute;metros b&aacute;sicos.</title>
              <graphic fileref="img/Captura016-config-apache-paso3-parametros.png" format="PNG" scale="40" />
</figure>
</listitem>
<listitem>
<para>
Despu&eacute;s podr&aacute; ver los Sitios Web Virtuales que maneja el servidor, si no desea manejar ninguno m&aacute;s pulse en Siguiente. Si desea 
configurar un nuevo Sitio Web Virtual pulse en a&ntilde;adir y siga los siguientes pasos.
</para>
<figure>
	<title>Configuraci&oacute;n de Sitios Web Virtuales.</title>
              <graphic fileref="img/Captura017-config-apache-paso4-virtual-host.png" format="PNG" scale="40" />
</figure>
</listitem>
<listitem>
<para>
A continuaci&oacute;n introduzca los par&aacute;metros de configuraci&oacute;n del nuevo servidor virtual: nombre del servidor, directorio principal del 
Sitio Web Virtual y el correo del administrador del sitio web virtual. Pulse en el bot&oacute;n Siguiente.
</para>
<figure>
	<title>Datos b&aacute;sicos de un Sitio Web Virtual.</title>
              <graphic fileref="img/Captura018-config-apache-paso4-2-nuevo-virtual-host.png" format="PNG" scale="40" />
</figure>
</listitem>
<listitem>
<para>
A continuaci&oacute;n introduzca otros par&aacute;metros de configuraci&oacute;n del nuevo servidor virtual: acceso a CGI, HTML p&uacute;blico, etc.. Pulse 
el bot&oacute;n Siguiente.
</para>
<figure>
	<title>Datos de Scripting de un Sitio Web Virtual.</title>
              <graphic fileref="img/Captura019-config-apache-paso4-3-nuevo-virtual-host2.png" format="PNG" scale="40" />
</figure>
</listitem>
<listitem>
<para>
Despu&eacute;s de a&ntilde;adir el nuevo sitio Web Virtual. Pulse en Siguiente.
</para>
<figure>
	<title>Datos de Scripting de un Sitio Web Virtual.</title>
              <graphic fileref="img/Captura020-config-apache-paso4-4-nuevo-virtual-host3.png" format="PNG" scale="40" />
</figure>
</listitem>
<listitem>
<para>
Despu&eacute;s de configurar los Sitios Web Virtuales, marque la opci&oacute;n Iniciar el servidor web en el arranque. Pulse en Siguiente.
</para>
<figure>
	<title>Configuraci&oacute;n del arranque del servidor.</title>
              <graphic fileref="img/Captura021-config-apache-paso5.png" format="PNG" scale="40" />
</figure>
</listitem>
<listitem>
<para>
A continuaci&oacute;n se configurar&aacute; el servidor web y se rearrancar&aacute; si es necesario. Pulse en Finalizar.
</para>
<figure>
	<title>Aplicaci&oacute;n de las configuraciones del servidor web.</title>
              <graphic fileref="img/Captura022-config-apache-paso6-activacion.png" format="PNG" scale="40" />
</figure>
</listitem>
<listitem>
<para>
A continuaci&oacute;n introduzca la url en el navegador web y compruebe que se visualiza correctamente.
</para>
<figure>
	<title>Visualizaci&oacute;n de prueba del servidor web.</title>
              <graphic fileref="img/Captura023-validacion-apache.png" format="PNG" scale="70" />
</figure>
</listitem>
<listitem>
<para>
Ahora es necesario comprobar si el m&oacute;dulo de php funciona correctamente, para lo cual es necesario crear un fichero index.php 
en el directorio principal del dominio del Sitio Web Virtual. Para ello necesita abrir 
una terminal con permisos de superadministrador, esto se puede conseguir si va al Men&uacute; de Acciones, pesta&ntilde;a Aplicaciones, 
submen&uacute; Sistema, submen&uacute; Terminal, icono Programa de terminal - modo de superusuario. Le solicitar&aacute; la contrase&ntilde;a del 
superadministrador (root), introduzcala pulse en el bot&oacute;n OK.
</para>
<para>Una vez abierta la terminal ejecute los siguientes comandos:</para>
<para>echo "<?php phpinfo(); ?>" >/srv/www/htdocs/index.php</para>
<para>chmod 777 /srv/www/htdocs/index.php</para>
<para>Evidentemente la ruta debe coincidir con la localizaci&oacute;n del directorio raiz del Sitio Web Virtual</para>
<para>Despu&eacute;s abra su navegador e introduzca la url seguido de /index.php  En nuestro ejemplo www.midominio.com/index.php Si se abre 
correctamente podr&aacute; ver la informaci&oacute;n del m&oacute;dulo php instalado en su Apache.</para>
<figure>
	<title>Visualizaci&oacute;n de prueba del m&oacute;dulo PHP.</title>
              <graphic fileref="img/Captura023-2-validacion-php.png" format="PNG" scale="50" />
</figure>
</listitem>
</itemizedlist>

</section>
<section>
<title>Configuraci&oacute;n de Mysql</title>
<para>A fin de poder arrancar autom&aacute;ticamente en el arranque el servidor Mysql es necesario modificar los niveles de arranque. 
Para lo cual entre en YAST y vaya a la pesta&ntilde;a Sistema y entre en el editor de niveles de ejecuci&oacute;n. 
</para>
<figure>
	<title>Entrada al editor de niveles de ejecuci&oacute;n.</title>
              <graphic fileref="img/Captura024-niveles-ejecucion-acceso.png" format="PNG" scale="40" />
</figure>
<para>
Los pasos a seguir son los siguientes:
</para>
<itemizedlist>
<listitem>
<para>
A continuaci&oacute;n selecciones el servicio Mysql con el bot&oacute;n derecho del rat&oacute;n y pulse el bot&oacute;n Activar situado abajo a la izquierda 
de la pantalla.
</para>
<figure>
	<title>Visualizaci&oacute;n de prueba del servidor web.</title>
              <graphic fileref="img/Captura025-niveles-ejecucion-pantalla-principal.png" format="PNG" scale="40" />
</figure>
<para>Una vez activado el servicio sandr&aacute; una pantalla con el resultado (deber&iacute;a marcar un &eacute;xito en el proceso de activaci&oacute;n). 
Pulse en el bot&oacute;n Ok. Despu&eacute;s pulse en el bot&oacute;n finalizar.</para>

<figure>
	<title>Pantalla del resultado del proceso (con &eacute;xito).</title>
              <graphic fileref="img/Captura026-niveles-ejecucion-resultado.png" format="PNG" scale="80" />
</figure>
<para>Despu&eacute;s pulse el bot&oacute;n Finalizar para que se apliquen los cambios.Cuando salga la pantalla de validaci&oacute;n pulse en Si.</para>
<figure>
	<title>.</title>
              <graphic fileref="img/Captura027-niveles-ejecucion-confirmacion.png" format="PNG" scale="100" />
</figure>
</listitem>
</itemizedlist>
<para>Ser&iacute;a conveniente recordar que el usuario por defecto de mysql tras la instalaci&oacute;n es root y no dispone de una contrase&ntilde;a 
asignada.</para>
<para>A fin de poder gestionar correctamente Mysql pasaremos al siguiente paso, Instalar la aplicaci&oacute;n Web Phpmyadmin</para>
</section>

<section>
<title>Instalaci&oacute;n y configuraci&oacute;n de PhpMyadmin</title>
<para>Para poder gestionar de una manera sencilla Mysql, instalaremos Phpmyadmin, una herramienta de gesti&oacute;n de Mysql v&iacute;a web. As&iacute; 
mataremos dos p&aacute;jaros de un tiro.
</para>
<para>
Los pasos a seguir son los siguientes:
</para>
<itemizedlist>
<listitem>
<para>
Descargarse la &uacute;ltima versi&oacute;n de Phpmyadmin, por ejemplo desde aqu&iacute;:
http://ovh.dl.sourceforge.net/sourceforge/phpmyadmin/phpMyAdmin-2.10.0.2-all-languages-utf-8-only.tar.gz
</para>
<para>cuando nos pregunte el navegador qu&eacute; hacer con el le diremos que queremos guardarlo en el disco duro, en el escritorio 
por ejemplo.</para>

</listitem>
<listitem>
<para>Una vez descargado el fichero deberemos descomprimirlo, para lo cual pulsamos sobre &eacute;l para abrirlo y descomprimirlo tb 
en el escritorio</para>
</listitem>
<listitem>
<para>Despu&eacute;s debe copiar el contenido de la carpeta que incluya el index.php al directorio /srv/www/phpmyadmin</para>
<para>Debe recordar que para hacer esto es necesario realizar esta operaci&oacute;n como  superadministrador del sistema.</para>
</listitem>
<listitem>
<para>Despu&eacute;s debe modificar los permisos de la carpeta para que el usuario root tenga permisos de acceso a los ficheros.</para>
</listitem>
<listitem>
<para>Despu&eacute;s debe comprobar mediante el navegador que tiene acceso a la url http://localhost/phpmyadmin/index.php. 
En nuestro ejemplo: http://www.midominio.com/phpmyadmin/index.php</para>
</listitem>
</itemizedlist>
</section>
</chapter>
 
