<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="Author" content="Francisco J. Palacios Burgos">
   <title>Taller de Perl - Perl B&aacute;sico</title>
</head>
<body background="fondo.jpg">

<div ALIGN=right>
<h1>
<img SRC="camel.gif" height=149 width=144></h1></div>

<h3>
1. &iquest;Qu&eacute; es PERL?</h3>

<p><br>PERL (Practical Extraction and Report Languaje) es un lenguaje creado
en 1987 por Larry Wall.
<p>La versi&oacute;n 1.0 se lanz&oacute; el 18 de Octubre de ese mismo
a&ntilde;o en el grupo de usenet comp.sources, aunque hasta la versi&oacute;n
3.0 del 18 de Octubre de 1989 no se publica con licencia GNU.
<p>El objetivo para el cu&aacute;l se dise&ntilde;a Perl es el disponer
de un lenguaje de prop&oacute;sito general que permita simplificar la mayor&iacute;a
de las tareas de administraci&oacute;n de un sistema tipo UNIX.
<p>Actualmente se encuentra por la versi&oacute;n 5.6 que es la que se
puede encontrar en la mayor&iacute;a de las distribuciones Linux actuales
y se est&aacute; trabajando en la 6.0. Perl es "multiplataforma", en el
sentido de que se encuentra disponible para un amplio n&uacute;mero de
sistemas operativos como Linux, UNIX, MVS, VMS, MS/DOS, Macintosh, OS/2,
Amiga
<br>&nbsp;
<br>&nbsp;
<h3>
2. &iquest;Cu&aacute;les son las caracter&iacute;sticas de Perl?</h3>
Perl es interpretado. Al contrario que otros lenguajes como C/C++ o Pascal,
los programas Perl son scripts de aspecto parecido a los scripts para la
shell (aunque en la realidad el int&eacute;rprete los compila antes de
ejecutarlos)
<p>Se tienen las estructuras de control de los lenguajes estructurados
modernos como bloques condicionales, bloques iterativos, definici&oacute;n
de rutinas, funciones y m&oacute;dulos, etc...
<p>Perl naci&oacute; en UNIX y por tanto pone a disposici&oacute;n del
programador la mayor&iacute;a de las llamadas que podemos encontrar en
ese sistema. En otras plataformas alguna de las funcionalidades de esas
llamadas puede no estar disponible. Entre las llamadas al sistema de que
disponemos est&aacute;n las de manipulaci&oacute;n de ficheros (open, read,
write, ...), de creaci&oacute;n de procesos (fork, exec, kill, ...) de
comunicaciones (getnetbyaddr, socket, sokectpair, ...)
<p>Tiene un mecanismo de&nbsp; b&uacute;squeda de patrones y expresiones
regulares extraordinariamente potente. Esto lo hace adecuado para tareas
de administraci&oacute;n de sistema, donde a veces es necesario tratar
con grandes cantidades de informaci&oacute;n distribuida en m&uacute;ltiples
ficheros (ficheros de log).
<p>Hay mucha gente que programa en Perl, lo que nos permite encontrar en
Internet una gran cantidad de c&oacute;digo en forma de m&oacute;dulos
y reutilizarlo para resolver un amplio abanico de problemas
<p>Se puede aplicar a la tecnolog&iacute;a CGI (Common Gateway Interface)
y algunos programas lo est&aacute;n usando como lenguaje de scripts (perl-fu
para Gimp).
<br>&nbsp;
<br>&nbsp;
<h3>
3. &iquest;C&oacute;mo s&eacute; si dispongo de Perl en mi sistema?</h3>
Si la plataforma en la que se trabaja es UNIX-like, basta con teclear el
comando en el prompt de la shell
<blockquote>&nbsp;
<table BORDER=0 COLS=1 WIDTH="30%" BGCOLOR="#FFFFCC" NOSAVE >
<tr NOSAVE>
<td NOSAVE><i>$&nbsp;&nbsp;&nbsp; which perl</i></td>
</tr>
</table>
</blockquote>
y si se obtiene algo parecido a lo siguiente:
<blockquote>&nbsp;
<table BORDER=0 COLS=1 WIDTH="30%" BGCOLOR="#FFFFCC" NOSAVE >
<tr NOSAVE>
<td NOSAVE><i>/usr/bin/perl</i></td>
</tr>
</table>
</blockquote>
es que est&aacute; instalado y accesible en el PATH
<p>En otro tipo de plataformas basta con mirar en los directorios donde
se suelen instalar los programas.
<br>&nbsp;
<p>
<hr WIDTH="100%">
<center><table BORDER=0 COLS=3 WIDTH="25%" NOSAVE >
<tr NOSAVE>
<td ALIGN=CENTER VALIGN=CENTER NOSAVE>
<center><a href="index.html"><img SRC="ol.gif" BORDER=0 height=44 width=65></a></center>
</td>

<td ALIGN=CENTER VALIGN=CENTER NOSAVE>
<center><a href="index.html"><img SRC="home02.gif" BORDER=0 height=75 width=61></a></center>
</td>

<td ALIGN=CENTER VALIGN=CENTER NOSAVE>
<center><a href="node2.html"><img SRC="or.gif" BORDER=0 height=44 width=65></a></center>
</td>
</tr>

<tr NOSAVE>
<td ALIGN=CENTER VALIGN=CENTER NOSAVE>
<center><a href="index.html">Anterior</a></center>
</td>

<td ALIGN=CENTER VALIGN=CENTER NOSAVE>
<center><a href="index.html">Home</a></center>
</td>

<td ALIGN=CENTER VALIGN=CENTER NOSAVE>
<center><a href="node2.html">Siguiente</a></center>
</td>
</tr>
</table></center>

</body>
</html>
