<?xml version='1.0' encoding='utf-8'?>
  <chapter>
    <title>Introducci&oacute;n</title>
    <para>Samba es un conjunto de aplicaciones que permiten establecer una arquitectura <emphasis>Cliente/Servidor</emphasis> para la compartici&oacute;n de recursos en sistemas heterog&eacute;neos.</para>

    <important><para>SMB (Server Message Block) es un protocolo definido por Microsoft e Intel en 1.987 y permite el intercambio de servicios (acceso a discos duros, impresoras y puertos serie) y se encuentra implementado en todos los entornos Windows. Los equipos que utilizan SMB pueden trabajar como clientes &oacute; como servidores, aunque generalmente los clientes ser&aacute;n m&aacute;quinas con sistema operativo de Microsoft.</para></important>

    <para>SMB es totalmente independiente del medio de transporte, y esto hace que pueda trabajar sobre TCP/IP, NetBEUI &oacute; IPX/SPX. La base de este protocolo (RFC 1001, RFC 1002) son bloques de mensajes, a los cu&aacute;les se les denomina SMBs, y que tanto el servidor como el cliente utilizan para comunicarse. Inicialmente fue escrito para UNIX pero ha sido portado a OS/2, VMS y NetWare. Dentro de UNIX funciona sobre Solaris, SCO, HP-UX, GNU/Linux y otros.</para>

    <para>Samba es un servidor SMB gratuito (Licencia GNU) desarrollado por Andrew Tridgell. Samba permite que Linux act&uacute;e como servidor SMB permitiendo a m&aacute;quinas Windows acceder a recursos compartidos tales como impresoras &oacute; discos duros. La mayor&iacute;a de las distribuciones actuales incluyen Samba en su conjunto de paquetes suministrados.</para>

    <important><para>En el cliente Windows, es necesario instalar TCP/IP y el Cliente para redes Microsoft.</para></important>

    <sect1>
      <title>Compilaci&oacute;n del Kernel</title>
      <para>Habilitar (&oacute; compilar como m&oacute;dulos) las siguientes opciones:</para>
<orderedlist>
<listitem>
<para>File Systems -&gt; DOS/FAT/NT Filesystems -&gt; MSDOS fs support</para>
</listitem>
<listitem>
<para>File Systems -&gt; DOS/FAT/NT Filesystems -&gt; VFAT (Windows 95) fs support</para>
</listitem>
<listitem>
<para>File Systems -&gt; Network File Systems -&gt; SMB file system support (to mount ...)</para>
</listitem>
<listitem>
<para>File Systems -&gt; Network File Systems -&gt; CIFS support (advanced network ...)</para>
</listitem>
</orderedlist>

    </sect1>

    <sect1>
      <title>Lanzar Samba</title>
      <para><command>smbd</command> es el daemon Samba propiamente dicho. Escucha las peticiones de los clientes por el puerto 139/tcp. El segundo daemon, <command>nmbd</command> es un servidor de nombres de NetBIOS para soporte de clientes, es decir, permite la resoluci&oacute;n de nombres en NetBIOS.</para>

<para>La configuraci&oacute;n de Samba se realiza a partir del fichero <filename>/etc/samba/smb.conf</filename>, que lee el demonio correspondiente cuando se inicia GNU/Linux. Este fichero est&aacute; dividido en una serie de secciones, como se ver&aacute; m&aacute;s adelante. Una vez realizados los cambios pertinentes en este fichero, se debe administrar <command>smbd</command> con:</para>

<screen>
/etc/init.d/smb start | stop | status | restart.
</screen>

<para>Para administrar <command>nmbd</command>, ejecutar <command>/etc/init.d/nmb start | stop | status | restart</command>.</para>

<para>Otra forma de administrar y lanzar Samba consiste en acceder a <emphasis>YaST -&gt; Servicios de red -&gt; Servidor Samba</emphasis>. Esta forma permite, de forma visual, realizar cambios en la configuraci&oacute;n de Samba sin manipular directamente el archivo <filename>/etc/samba/smb.conf</filename>, aunque todos los cambios que se realicen se guardar&aacute;n posteriormente en dicho archivo.</para>

<para><command>smbd</command> &uacute;nicamente permite que GNU/Linux sea servidor (no cliente). Para que act&uacute;e como cliente se utilizar&aacute;n otras utilidades.</para>

<para>Hay cuatro cosas que pueden hacerse con Samba:</para>

<orderedlist>
<listitem>
<para>Compartir una unidad de GNU/Linux con m&aacute;quinas Windows.</para>
</listitem>
<listitem>
<para>Compartir una unidad de Windows con m&aacute;quinas GNU/Linux.</para>
</listitem>
<listitem>
<para>Compartir una impresora GNU/Linux con m&aacute;quinas Windows.</para>
</listitem>
<listitem>
<para>Compartir una impresora Windows con m&aacute;quinas GNU/Linux.</para>
</listitem>
</orderedlist>

<para>El rendimiento del servidor, en cuanto a tiempo se refiere, es inferior al de otras aplicaciones de este tipo.</para>

    </sect1>

    <sect1>
      <title>Seguridad</title>
      <para>Todo lo indicado en este apartado supone que cada usuario que desee utilizar alguno de los servicios suministrados por Samba debe tener una cuenta de usuario en el servidor GNU/Linux. Adem&aacute;s, este nombre de usuario debe ser el mismo en la m&aacute;quina Windows que en la m&aacute;quina GNU/Linux y tambi&eacute;n este nombre de usuario debe a&ntilde;adirse al conjunto de usuarios que Samba puede manipular mediante el comando <command>smbpasswd</command>.</para>

<para>En el caso de que no se quiera una conexi&oacute;n autentificada, para conectarse a Samba, pueden seguirse los siguientes pasos:</para>

<orderedlist>
<listitem>
<para>Copiar el archivo <filename>/usr/share/doc/packages/samba/Registry/*_PlainPassword.reg</filename> a la m&aacute;quina Windows. Evidentemente, habr&aacute; que copiar el archivo correspondiente a la versi&oacute;n de Windows deseada.</para>
</listitem>
<listitem>
<para>Desde la m&aacute;quina Windows, doble clic sobre el archivo anterior.</para>
</listitem>
<listitem>
<para>Reiniciar la m&aacute;quina Windows.</para>
</listitem>
<listitem>
<para>La secci&oacute;n [homes] del <filename>smb.conf</filename> se sustituye por la [%U] y su contenido puede ser:</para>
</listitem>
</orderedlist>
</sect1>
<sect1>
<title><command>smbpasswd</command></title>

<para>Si se usa, se debe inicializar <emphasis>encrypt passwords = yes</emphasis> . Permite a&ntilde;adir usuarios al fichero de configuraci&oacute;n <filename>/etc/samba/smbpasswd</filename> o cambiar la contrase&ntilde;a ya existente.</para>
<screen>
smbpasswd -a &lt;usuario&gt; a&ntilde;ade un usuario
smbpasswd &lt;usuario&gt; cambia la contrase&ntilde;a de &lt;usuario&gt;
</screen>
    </sect1>

    <sect1>
      <title>Conexi&oacute;n de una m&aacute;quina cliente Windows</title>
<programlisting>create mode = 750
browseable = yes
comment = Directorio de %U
directory = /home/%U
</programlisting>
    </sect1>
    <sect1>
      <title>Utilidad swat (Samba Web Administration Tool)</title>

      <para>Existe la posibilidad de administrar Samba desde un navegador Web utilizando swat. Se consigue tecleando la siguiente URL:</para>
<programlisting>
http://&lt;IPServidorWeb&gt;:901
</programlisting>
      <para>Cuando se arranque, esta p&aacute;gina Web pedir&aacute; la contrase&ntilde;a del root.</para>

      <para>Para activar <command>swat</command>, hay que acceder al <emphasis>YaST -&gt; Centro de Control -&gt; Servicios de red (inetd)</emphasis> y activar el servicio correspondiente.Asimismo, se debe modificar el siguiente fichero <filename>/etc/xinet.d/swat</filename> en su par&aacute;metro <emphasis>only_from</emphasis> de tal forma que apunte a la IP desde la cu&aacute;l se va a administrar Samba.</para> 

<important><para>Evidentemente, habr&aacute; que reiniciar <command>xinetd</command> tras hacer cambios en este fichero.</para></important>
    </sect1>

  </chapter>

